## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 0 to add, 5 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cartography_launcher_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cartography_launcher_lambda"  {
      ~ id      = "3840157142" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "iam:PassRole",
                          - "iam:GetRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
                          - "arn:aws:iam::794722365809:role/cartography_container_execution_role",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.aws_iam_policy_document.cartography_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cartography_policies"  {
      ~ id      = "3931517316" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::996667111599:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::902343555465:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::805525519938:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::722713121070:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::515018049985:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::473697194269:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::028051698106:role/secopsAssetInventorySecurityAuditRole",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_auth",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/elasticsearch_user",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/elasticsearch_password",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              + "arn:aws:iam::005133826942:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::009883649233:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::059208818674:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::124044056575:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::136676205420:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::160411545784:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::236007890657:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::239043911459:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::276192857112:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::283582579564:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::296255494825:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::339850311124:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::349837941862:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::400061975867:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::406214159830:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::414662622316:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::472286471787:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::507252742351:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::537819865265:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::563894450011:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::595701125956:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::637287734259:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::687401027353:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::729164266357:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::762579868088:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::773858180673:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::794722365809:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::806545929748:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::820252213580:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::843973686572:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::871282759583:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::894242006032:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::925306372402:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::955148791056:role/secopsAssetInventorySecurityAuditRole",
              + "arn:aws:iam::957818836222:role/secopsAssetInventorySecurityAuditRole",
                # (7 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_iam_policy.cartography_launcher_lambda will be updated in-place
  ~ resource "aws_iam_policy" "cartography_launcher_lambda" {
        id        = "arn:aws:iam::794722365809:policy/CartographyLauncherLambdaRolePolicy"
        name      = "CartographyLauncherLambdaRolePolicy"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "iam:PassRole",
                          - "iam:GetRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
                          - "arn:aws:iam::794722365809:role/cartography_container_execution_role",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.cartography_policies will be updated in-place
  ~ resource "aws_iam_policy" "cartography_policies" {
        id        = "arn:aws:iam::794722365809:policy/CartographyContainerExecutionPolicies"
        name      = "CartographyContainerExecutionPolicies"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::996667111599:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::902343555465:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::805525519938:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::722713121070:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::515018049985:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::473697194269:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::028051698106:role/secopsAssetInventorySecurityAuditRole",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_auth",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/elasticsearch_user",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/elasticsearch_password",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.cartography_task_execution_policies will be updated in-place
  ~ resource "aws_iam_policy" "cartography_task_execution_policies" {
        id        = "arn:aws:iam::794722365809:policy/CartographyTaskExecutionPolicies"
        name      = "CartographyTaskExecutionPolicies"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            "arn:aws:iam::996667111599:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::957818836222:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::955148791056:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::925306372402:role/secopsAssetInventorySecurityAuditRole",
                            "arn:aws:iam::902343555465:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::894242006032:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::871282759583:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::843973686572:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::820252213580:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::806545929748:role/secopsAssetInventorySecurityAuditRole",
                            "arn:aws:iam::805525519938:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::794722365809:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::773858180673:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::762579868088:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::729164266357:role/secopsAssetInventorySecurityAuditRole",
                            "arn:aws:iam::722713121070:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::687401027353:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::637287734259:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::595701125956:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::563894450011:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::537819865265:role/secopsAssetInventorySecurityAuditRole",
                            "arn:aws:iam::515018049985:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::507252742351:role/secopsAssetInventorySecurityAuditRole",
                            "arn:aws:iam::473697194269:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::472286471787:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::414662622316:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::406214159830:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::400061975867:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::349837941862:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::339850311124:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::296255494825:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::283582579564:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::276192857112:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::239043911459:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::236007890657:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::160411545784:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::136676205420:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::124044056575:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::059208818674:role/secopsAssetInventorySecurityAuditRole",
                            "arn:aws:iam::028051698106:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::009883649233:role/secopsAssetInventorySecurityAuditRole",
                          + "arn:aws:iam::005133826942:role/secopsAssetInventorySecurityAuditRole",
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.cartography_launcher will be updated in-place
  ~ resource "aws_lambda_function" "cartography_launcher" {
        id                             = "launch_cartography"
      ~ last_modified                  = "2022-04-29T00:37:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "e57xdwjYvd5BlenxZEdZLaKtRDTcmcEd7yRYEq78RQs=" -> "w6q+p7LsyCPjBlbkBX+2tdQxxhUVewKH0BGsHBDgMTA="
        tags                           = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_ssm_parameter.asset_inventory_account_list will be updated in-place
  ~ resource "aws_ssm_parameter" "asset_inventory_account_list" {
        id        = "/cartography/asset_inventory_account_list"
        name      = "/cartography/asset_inventory_account_list"
        tags      = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
      ~ value     = (sensitive value)
      ~ version   = 2 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
